test/interFoam_Python_test/tests/interMUIFoam-obstacle/caseSetup/fluidDomain/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.water.*"
    {
        nAlphaCorr      2;
        nAlphaSubCycles 1;
        cAlpha          1;
        MULESCorr       yes;
        nLimiterIter    5;
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }

    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0.05;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }
    p
    {
        solver                PCG;
        preconditioner        DIC;
        tolerance             1e-8;
        relTol                0.01;
        smoother              GaussSeidel;
        nSweeps               0;
        cacheAgglomeration    true;
        agglomerator          faceAreaPair;
        nCellsInCoarsestLevel 20;
        mergeLevels           1;
        nPreSweeps            0;
        nPostSweeps           2;
        nFinestSweeps         2;
        maxIter               1000;
        minIter               3;
        scaleCorrection       true;
        directSolveCoarsest   false;
    }

    pFinal
    {
        solver                PCG;
        preconditioner        DIC;
        tolerance             1E-08;
        relTol                0.;
        smoother              GaussSeidel;
        nSweeps               0;
        cacheAgglomeration    true;
        agglomerator          faceAreaPair;
        nCellsInCoarsestLevel 20;
        mergeLevels           1;
        nPreSweeps            0;
        nPostSweeps           2;
        nFinestSweeps         2;
        maxIter               1000;
        minIter               3;
        scaleCorrection       true;
        directSolveCoarsest   false;
    }

    "pcorr.*"
    {
        $p
        tolerance             1E-08;
        relTol                0;
    }

    U
    {
        solver                PBiCG;
        preconditioner        DILU;
        tolerance             1E-08;
        relTol                0.001;
        smoother              None;
        nSweeps               0;
        cacheAgglomeration    no;
        agglomerator          faceAreaPair;
        nCellsInCoarsestLevel 0;
        mergeLevels           0;
        nPreSweeps            0;
        nPostSweeps           0;
        nFinestSweeps         0;
        maxIter               1000;
        minIter               3;
    }

    UFinal
    {
        solver                PBiCG;
        preconditioner        DILU;
        tolerance             1E-8;
        relTol                0.;
        smoother              None;
        nSweeps               0;
        cacheAgglomeration    no;
        agglomerator          faceAreaPair;
        nCellsInCoarsestLevel 0;
        mergeLevels           0;
        nPreSweeps            0;
        nPostSweeps           0;
        nFinestSweeps         0;
        maxIter               1000;
        minIter               3;
    }

}

PIMPLE
{
    nOuterCorrectors          3;
    nCorrectors               4;
    nNonOrthogonalCorrectors  5;
    pRefCell                  0;
    pRefValue                 0;

    momentumPredictor         true;
    correctPhi                true;
    moveMeshOuterCorrectors   true;
    checkMeshCourantNo        true;
    turbOnFinalIterOnly       true;
    residualControl
    {
        U
        {
            tolerance   1e-5;
            relTol      0.05;
        }
        p
        {
            tolerance   5e-4;
            relTol      0.1;
        }
    }
}

relaxationFactors
{
    fields
    {
        p                     1.0;
        pFinal                1.0;
    }
    equations
    {
        "U|k|epsilon"         1.0;
        "(U|k|epsilon)Final"  1.0;
    }
}

// ************************************************************************* //
